  {
    "dog1": {
    "type": "Labrador retriever",
    "imageUrl": "https://cdn.akc.org/Marketplace/Breeds/Labrador_Retriever_SERP.jpg",
    "description": "Known for being easygoing, multi-talented and friendly, Labs have held the top spot for longer than any other breed since the AKC started counting in the 1880s."
  },
    "dog2": {
    "type": "German shepherd",
    "imageUrl": "https://animalso.com/wp-content/uploads/2016/12/white-german-shepherd-puppies_1.jpg",
    "description": "German shepherds retained the No. 2 spot on the American Kennel Club\"s list of of 10 most popular dog breeds for 2017."
  },
    "dog3": {
    "type": "Golden retriever",
    "imageUrl": "https://cdn.akc.org/Marketplace/Breeds/Golden_Retriever_SERP.jpg",
    "description": "The golden retriever has always been a popular breed and is ranked No. 3 by the American Kennel Club for 2017, the same spot it held in 2015 and 2016."
  },
    "dog4": {
    "type": "French bulldog",
    "imageUrl": "https://i.pinimg.com/736x/21/63/16/216316f5ff080e85b8e6df496b266f7d.jpg",
    "description": "The French bulldog (Frenchie) is one of the most popular small-dog breeds. According to the AKC, the Frenchie is alert, adaptable and playful. "
  },
    "dog5": {
    "type": "Bulldog",
    "imageUrl": "https://cdn.akc.org/Marketplace/Breeds/Bulldog_SERP.jpg",
    "description": "The bulldogs have been quietly moving up the list. It hit No. 4 in 2014 -- the highest ranking in the breed\"s history. It kept that spot in 2016 but slipped to No. 5 in 2017."
  },
    "dog6": {
    "type": "Beagle",
    "imageUrl": "https://i.redd.it/eyofv7z7nwm11.jpg",
    "description": "The beagle -- a happy, inquisitive short-haired hound -- ranked No. 6 on the list of most popular dog breeds for 2017 by the AKC."
  },
    "dog7": {
    "type": "Poodle",
    "imageUrl": "https://www.doodlepuppy.com/wp-content/uploads/2018/08/Moyen_Poodle_Puppies.Cookie2018.f2.6015a.jpg",
    "description": "The poodle once reigned supreme, but is now ranked No. 7 by the AKC for 2017."
  }, 
    "dog8": {
    "type": "Rottweilers",
    "imageUrl": "https://cdn.akc.org/Marketplace/Breeds/Rottweiler_SERP.jpg",
    "description": "At No. 8, the Rottweiler posted its highest ranking in almost 20 years. Renowned for their loyalty, confidence and protective instincts, Rotties were America\"s second-most-popular dog in 1997 but faded to 17th within a decade, as some small breeds surged for a time. But Rottweilers muscled their way back into the top 10 in 2015."
  },
    "dog9": {
    "type": "Yorkshire terrier",
    "imageUrl": "https://cdn.akc.org/Marketplace/Breeds/Yorkshire_Terrier_SERP.jpg",
    "description": "The Yorkshire Terrier slipped down in the rankings a bit from No. 7 to No. 9 in 2016. The breed stayed at No. 9 in 2017. "
  },
    "dog10": {
    "type": "German shorthaired pointer",
    "imageUrl": "https://cdn.akc.org/Marketplace/Breeds/German_Shorthaired_Pointer_SERP.jpg",
    "description": "New to the top 10 in 2017, the German shorthaired pointer (GSP) enjoys exercise and love. According to the AKC, most owners call the breed their \"perfect pointer."
  }
}